{
    "Metadata": {
        "title": "Rogerio Nakayama QA",
        "description": "This is profesisonal QA Portfolio, presenting details about my experience, skills and personal projects. Hope we get in touch"
    },
    "Header": {
        "language_label": "Language:",
        "theme_button": "Theme selector button"
    },
    "Home": {
        "Badge": {
            "description": "Medal symbol contoured in black tone with a drawing of a right icon in green tone in the middle of the medal"
        },
        "role": "Quality Assurance Engineer | Brazil",
        "workDescription": "I'm a graduate in Software Analysis and Development with over 4 years of hands-on experience in the tech industry. I combine my formal education with solid commercial experience, actively participating in all phases of the software lifecycle, from initial planning to post-delivery. Throughout my career, I've created detailed documentation, applied a wide range of tools and testing techniques, and leveraged development knowledge to ensure software quality and reliability. I'm passionate about identifying complex problems, breaking them down into manageable parts, and building practical, effective solutions.",
        "personalTime": "When i am not working, i will probably be cooking a nice dish or maybe playing some video-games with my friends and family.",
        "contactButton": "CONTACT ME",
        "skills": "Skills",
        "Projects": {
            "title": "Projects",
            "Content": {
                "JavaRestAssured": {
                    "name": "Java + RestAssured integration testing"
                },
                "QuickpizzaK6": {
                    "name": "K6 + JavaScript load testing the QuickkPizza"
                },
                "CypressRWA": {
                    "name": "Cypress + Typescript e2e testing the Real World App"
                }
            }
        },
        "cog_alt": "Image of a lig gray cog",
        "Modal": {
            "title": "Contact me",
            "email_label": "Your E-mail",
            "email_placeholder": "example@email.com",
            "email_required": "The field E-mail is required",
            "email_invalid": "The field E-mail is invalid",
            "message_label": "Message",
            "message_placeholder": "Type your message",
            "message_required": "The field Message is required",
            "message_lenght_error": "The message length is greater than 255 characters",
            "send_button": "Send",
            "loading_button": "Loading...",
            "toast_success": "The email has been sent with success!",
            "toast_error": "An error occurred while sending the email! Try again later."
        }
    },
    "Footer": {
        "contact": "Contact Me"
    }
}